espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EFM32PG22/Include/efm32pg22_cmu.h
/* Bit fields for CMU EUART0CLKCTRL */
#define _CMU_EUART0CLKCTRL_RESETVALUE              0x00000001UL                                 /**< Default value for CMU_EUART0CLKCTRL         */
#define _CMU_EUART0CLKCTRL_MASK                    0x00000003UL                                 /**< Mask for CMU_EUART0CLKCTRL                  */
#define _CMU_EUART0CLKCTRL_CLKSEL_SHIFT            0                                            /**< Shift value for CMU_CLKSEL                  */
#define _CMU_EUART0CLKCTRL_CLKSEL_MASK             0x3UL                                        /**< Bit mask for CMU_CLKSEL                     */
#define _CMU_EUART0CLKCTRL_CLKSEL_DEFAULT          0x00000001UL                                 /**< Mode DEFAULT for CMU_EUART0CLKCTRL          */
#define _CMU_EUART0CLKCTRL_CLKSEL_DISABLED         0x00000000UL                                 /**< Mode DISABLED for CMU_EUART0CLKCTRL         */
#define _CMU_EUART0CLKCTRL_CLKSEL_EM01GRPACLK      0x00000001UL                                 /**< Mode EM01GRPACLK for CMU_EUART0CLKCTRL      */
#define _CMU_EUART0CLKCTRL_CLKSEL_EM23GRPACLK      0x00000002UL                                 /**< Mode EM23GRPACLK for CMU_EUART0CLKCTRL      */
#define CMU_EUART0CLKCTRL_CLKSEL_DEFAULT           (_CMU_EUART0CLKCTRL_CLKSEL_DEFAULT << 0)     /**< Shifted mode DEFAULT for CMU_EUART0CLKCTRL  */
#define CMU_EUART0CLKCTRL_CLKSEL_DISABLED          (_CMU_EUART0CLKCTRL_CLKSEL_DISABLED << 0)    /**< Shifted mode DISABLED for CMU_EUART0CLKCTRL */
#define CMU_EUART0CLKCTRL_CLKSEL_EM01GRPACLK       (_CMU_EUART0CLKCTRL_CLKSEL_EM01GRPACLK << 0) /**< Shifted mode EM01GRPACLK for CMU_EUART0CLKCTRL*/
#define CMU_EUART0CLKCTRL_CLKSEL_EM23GRPACLK       (_CMU_EUART0CLKCTRL_CLKSEL_EM23GRPACLK << 0) /**< Shifted mode EM23GRPACLK for CMU_EUART0CLKCTRL*/

/* Bit fields for CMU RTCCCLKCTRL */
#define _CMU_RTCCCLKCTRL_RESETVALUE                0x00000001UL                           /**< Default value for CMU_RTCCCLKCTRL           */
#define _CMU_RTCCCLKCTRL_MASK                      0x00000003UL                           /**< Mask for CMU_RTCCCLKCTRL                    */
#define _CMU_RTCCCLKCTRL_CLKSEL_SHIFT              0                                      /**< Shift value for CMU_CLKSEL                  */
#define _CMU_RTCCCLKCTRL_CLKSEL_MASK               0x3UL                                  /**< Bit mask for CMU_CLKSEL                     */
#define _CMU_RTCCCLKCTRL_CLKSEL_DEFAULT            0x00000001UL                           /**< Mode DEFAULT for CMU_RTCCCLKCTRL            */
#define _CMU_RTCCCLKCTRL_CLKSEL_LFRCO              0x00000001UL                           /**< Mode LFRCO for CMU_RTCCCLKCTRL              */
#define _CMU_RTCCCLKCTRL_CLKSEL_LFXO               0x00000002UL                           /**< Mode LFXO for CMU_RTCCCLKCTRL               */
#define _CMU_RTCCCLKCTRL_CLKSEL_ULFRCO             0x00000003UL                           /**< Mode ULFRCO for CMU_RTCCCLKCTRL             */
#define CMU_RTCCCLKCTRL_CLKSEL_DEFAULT             (_CMU_RTCCCLKCTRL_CLKSEL_DEFAULT << 0) /**< Shifted mode DEFAULT for CMU_RTCCCLKCTRL    */
#define CMU_RTCCCLKCTRL_CLKSEL_LFRCO               (_CMU_RTCCCLKCTRL_CLKSEL_LFRCO << 0)   /**< Shifted mode LFRCO for CMU_RTCCCLKCTRL      */
#define CMU_RTCCCLKCTRL_CLKSEL_LFXO                (_CMU_RTCCCLKCTRL_CLKSEL_LFXO << 0)    /**< Shifted mode LFXO for CMU_RTCCCLKCTRL       */
#define CMU_RTCCCLKCTRL_CLKSEL_ULFRCO              (_CMU_RTCCCLKCTRL_CLKSEL_ULFRCO << 0)  /**< Shifted mode ULFRCO for CMU_RTCCCLKCTRL     */

/* Bit fields for CMU CRYPTOACCCLKCTRL */
#define _CMU_CRYPTOACCCLKCTRL_RESETVALUE           0x00000000UL                               /**< Default value for CMU_CRYPTOACCCLKCTRL      */
#define _CMU_CRYPTOACCCLKCTRL_MASK                 0x00000003UL                               /**< Mask for CMU_CRYPTOACCCLKCTRL               */
#define CMU_CRYPTOACCCLKCTRL_PKEN                  (0x1UL << 0)                               /**< PK Enable                                   */
#define _CMU_CRYPTOACCCLKCTRL_PKEN_SHIFT           0                                          /**< Shift value for CMU_PKEN                    */
#define _CMU_CRYPTOACCCLKCTRL_PKEN_MASK            0x1UL                                      /**< Bit mask for CMU_PKEN                       */
#define _CMU_CRYPTOACCCLKCTRL_PKEN_DEFAULT         0x00000000UL                               /**< Mode DEFAULT for CMU_CRYPTOACCCLKCTRL       */
#define CMU_CRYPTOACCCLKCTRL_PKEN_DEFAULT          (_CMU_CRYPTOACCCLKCTRL_PKEN_DEFAULT << 0)  /**< Shifted mode DEFAULT for CMU_CRYPTOACCCLKCTRL*/
#define CMU_CRYPTOACCCLKCTRL_AESEN                 (0x1UL << 1)                               /**< AES Enable                                  */
#define _CMU_CRYPTOACCCLKCTRL_AESEN_SHIFT          1                                          /**< Shift value for CMU_AESEN                   */
#define _CMU_CRYPTOACCCLKCTRL_AESEN_MASK           0x2UL                                      /**< Bit mask for CMU_AESEN                      */
#define _CMU_CRYPTOACCCLKCTRL_AESEN_DEFAULT        0x00000000UL                               /**< Mode DEFAULT for CMU_CRYPTOACCCLKCTRL       */
#define CMU_CRYPTOACCCLKCTRL_AESEN_DEFAULT         (_CMU_CRYPTOACCCLKCTRL_AESEN_DEFAULT << 1) /**< Shifted mode DEFAULT for CMU_CRYPTOACCCLKCTRL*/

/** @} End of group EFM32PG22_CMU_BitFields */
/** @} End of group EFM32PG22_CMU */
/** @} End of group Parts */

#endif /* EFM32PG22_CMU_H */
